[{"MatchedObjectId": "800559500", "MatchedObjectDescriptor": {"PositionID": "24-DO-846-P", "PositionTitle": "Information Technology Specialist (Applications Software)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/800559500", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/800559500"], "PositionLocationDisplay": "Anywhere in the U.S. (remote job)", "PositionLocation": [{"LocationName": "Anywhere in the U.S. (remote job), United States", "CountryCode": "United States", "CityName": "Anywhere in the U.S. (remote job), United States", "Longitude": 0, "Latitude": 0}], "OrganizationName": "Treasury, Departmental Offices", "DepartmentName": "Department of the Treasury", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "OR"}], "PositionSchedule": [{"Name": "", "Code": "1"}], "PositionOfferingType": [{"Name": "", "Code": "15317"}], "QualificationSummary": "You must meet the following requirements by the closing date of this announcement. Specialized Experience: For the Band 60 (GS-14 equivalent) You must have one year of specialized experience at a level of difficulty and responsibility equivalent to the Band 53 (GS-13 equivalent) grade level in the Federal service. Specialized experience for this position is defined as proven proficiency and supportable (as evidenced in the resume) experience in ALL of the following: * Experience architecting, developing, and deploying Web based applications and data manipulation using PySpark; AND * Experience integrating systems by creating or consuming web APIs in front-end web development technologies including: HTML5, CSS3, and JS frameworks; AND * Experience administrating, configuring, operating and maintaining libraries in Anaconda for Python and/or R. In addition to specialized experience, individuals must have IT-related experience demonstrating each of the four competencies listed below. Attention to Detail: Is thorough when performing work and conscientious about attending to detail. Customer Service: Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. Oral Communication: Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. Problem Solving: Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.", "PositionRemuneration": [{"MinimumRange": "154057.0", "MaximumRange": "243172.0", "RateIntervalCode": "PA", "Description": "Per Year"}], "PositionStartDate": "2024-07-18T11:15:33.2830", "PositionEndDate": "2024-07-28T23:59:59.9970", "PublicationStartDate": "2024-07-18T11:15:33.2830", "ApplicationCloseDate": "2024-07-28T23:59:59.9970", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "The incumbent serves as Senior Developer in the Technology Center. This position leads and coordinates the analysis, design, documentation, development, modification, testing, installation, implementation, and support of new or existing applications software. Participates in implementing commercial off-the-shelf (COTS) software or developing customized applications using open source technologies.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "60", "HighGrade": "60", "PromotionPotential": "60", "OrganizationCodes": "TR/TR91", "Relocation": "False", "HiringPath": ["public", "fed-transition"], "TotalOpenings": "1", "AgencyMarketingStatement": "The U.S. Department of the Treasury has a distinguished history dating back to the founding of our nation. As the steward of U.S. economic and financial systems, Treasury is a major and influential leader in today's global economy. We have over 100,000 employees across the country and around the world and we make diversity of thoughts and inclusion a core value. Come Join the Department of the Treasury and Invest in Tomorrow. This is a remote position. The salary range listed depicts DC locality pay. Salary will be determined upon selection and dependent upon duty location, grade, step, and locality pay of selectee(s). Additional salary information can be found on Compensation and Benefits - Office of Financial Research.", "TravelCode": "1", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus", "MajorDuties": ["**IMPORTANT PLEASE READ** This announcement contains a two-phase process. Upon completion of Phase 1, you must click on the exclusive link to complete the manual assessment. The next phase it will take one hour, at a minimum, to complete. As an Information Technology Specialist (Applications Software); you will: Be responsible for working on agile, cross-functional teams with developers, testers, business analysts, and other stakeholders. Help the team plan and prioritize features, create user stories and tasks, and estimate effort. Must be comfortable with pairing, test-driven development, and emergent architecture. Establish quality standards and guidance, to include practices and tools. Design software for testability and performs rigorous automated testing. Incorporates static analysis and performance monitoring. Automate software builds, unit and functional test suites, database migrations, system configurations, and deployments in pursuit of a Continuous Delivery environment."], "Education": "", "Requirements": "The experience may have been gained in either the public, private sector or volunteer service. One year of experience refers to full-time work; part-time work is considered on a prorated basis. To ensure full credit for your work experience, please indicate dates of employment by month/day/year, and indicate number of hours worked per week on your resumé. Key Requirements: Must be U.S. Citizen or U.S. National. A one-year probationary period may be required. Must successfully complete a background investigation. Public Trust - Background Investigation will be required. All new hires will be required to comply with federal ethics laws. A review of financial or other interests may be conducted to determine if they create any real or apparent conflict of interests with official Treasury duties. Complete a Declaration for Federal Employment to determine your suitability for Federal employment, at the time requested by the agency. Have your salary sent to a financial institution of your choice by Direct Deposit/Electronic Funds Transfer. If you are a male applicant born after December 31, 1959, certify that you have registered with the Selective Service System or are exempt from having to do so. Go through a Personal Identity Verification (PIV) process that requires two forms of identification from the Form I-9. Federal law requires verification of the identity and employment eligibility of all new hires in the U.S. Obtain and use a Government-issued charge card for business-related travel. Please refer to the \"Additional Information\" section for additional Conditions of Employment.", "Evaluations": "THIS IS A TWO-PHASED PROCESS. Phase 1: Your application will be evaluated in the following areas: Technical, Analytical, and Communication Category rating will be used to rank and select eligible candidates. Depending on your responses to the online questions regarding your qualifications, experience, education, and training related to this position, you will be assigned to one of three quality level categories, A, B, or C. Your rating may be lowered if your responses to the online questions are not supported by the education and/or experience described in your application. Your application may be reviewed by a Subject Matter Expert. Phase 2: You will be given an exclusive link in the last question of this assessment to complete a manual assessment for Phase 2. Please be sure to allow sufficient time to complete the questions before the close date of the second announcement. Failure to complete the narrative questions will result in an incomplete application and no further consideration will be given. Your narrative responses will be rated and ranked by a Subject Matter Expert (SME) to determine your level of proficiency. Veterans' preference is applied after applicants are assessed. Preference-eligibles will be listed at the top of their assigned category and considered before non-preference-eligibles in that category. Qualified preference-eligibles with a compensable service-connected disability of 10% or more will be listed at the top of the highest category. Referral: If you are among the top qualified candidates, your application may be referred to a selecting official for consideration. You may be required to participate in a selection interview. If you are a displaced or surplus Federal employee (eligible for the Career Transition Assistance Plan (CTAP)/Interagency Career Transition Assistance Plan (ICTAP)) you must be assigned the middle category or better to be rated as \"well qualified\" to receive special selection priority.", "HowToApply": "DO has partnered with the Treasury's Bureau of the Fiscal Service to provide certain personnel services to its organization. Fiscal Service's responsibilities include advertising vacancies, accepting and handling applications, and extending job offers. The following instructions outline our application process. You must complete this application process and submit any required documents by 11:59 p.m. Eastern Time (ET) on the closing date of this announcement. We are available to assist you during business hours (normally 8:00 a.m. - 5:00 p.m. ET, Monday - Friday). If applying online poses a hardship, please contact us by noon ET on the announcement's closing date. The Bureau provides reasonable accommodation to applicants with disabilities on a case-by-case basis. Please contact us if you require this for any part of the application and hiring process. To begin, click Apply to access the online application. You will need to be logged into your USAJOBS account to apply. If you do not have a USAJOBS account, you will need to create one before beginning the application. Follow the prompts to select your resumé and/or other supporting documents to be included with your application package. You will have the opportunity to upload additional documents to include in your application before it is submitted. Your uploaded documents may take several hours to clear the virus scan process. After acknowledging you have reviewed your application package, complete the Include Personal Information section as you deem appropriate and click to continue with the application process. You will be taken to the online application which you must complete in order to apply for the position. Complete the online application, verify the required documentation is included with your application package, and submit the application. IN ORDER TO COMPLETE BOTH PHASES, YOU WILLNEED TO SUBMIT YOUR APPLICATION IN BOTH ANNOUNCEMENTS. To do this: 1. Click on the link provided in the last question of announcement number 1 (this announcement). This will open a new window to the second announcement. 2. Before completing the application in the new window, click back to announcement number 1 (this announcement) and finish the remaining steps through submitting your application. 3. Click back on the second (new) window for announcement number 2. You will need to click on the APPLY button on the second announcement and go through the 5 steps in USA Jobs to get to the narrative questions. 4. Review and submit your second announcement application. Once completed, BOTH announcements should show the Application Status as Application Submitted. Please do not share the link with anyone else, as the exclusive link is for you to complete your application. There is a 2,500 character limit on each response. Please allow sufficient time to complete before midnight on the close date of the announcement. The narrative responses are expected to take one hour, at a minimum. Non-detailed and answers such as N/A, see resumé, etc. will be deemed ineligible. To verify the status of your application: -Log into your USAJOBS account (USAJOBS Login). A list of announcements in which you have applied is at the Welcome screen. -Under \"application status,\" click \"Track this application\" and you will be taken to the agency website where you can check your application status. For more information regarding the job and applicant status, please refer to https://www.usajobs.gov/Help/how-to/application/status/ If you wish to make changes/updates to your application and the vacancy is still open, you can click on the job announcement and \"Update Application\" to be taken back to your application. No updates can be made once the announcement has closed. Please notify us if your contact information changes after the closing date of the announcement. Also, note that if you provide an email address that is inaccurate or if your mailbox is full or blocked (e.g., spam-blocker), you may not receive important communication that could affect your consideration for this position. For additional information on how to apply, please visit the Partnership for Public Service's Go Government website. The Fair Chance to Compete for Jobs Act prohibits the Department of Treasury and its bureaus from requesting an applicant's criminal history record before that individual receives a conditional offer of employment. In accordance with 5 U.S. Code § 9202(c) and 5 C.F.R § 920.201 certain positions are exempt from the provisions of the Fair Chance to Compete Act. Applicants who believe they have been subjected to a violation of the Fair Chance to Compete for Jobs Act, may submit a written complaint to the Department of Treasury by email at, FairChanceAct@treasury.gov. To learn more, please visit our page at: Treasury.gov/fairchanceact. To preview the assessment questionnaire: https://apply.usastaffing.gov/ViewQuestionnaire/12484137", "WhatToExpectNext": "Once the online questionnaire is received, you will receive an acknowledgement email that your submission was successful. YOU MUST COMPLETE THE PHASE 2 QUESTIONS. Failure to complete the narrative questions will result in an incomplete application and no further consideration will be given. After the Phase 2 announcement closes, we will review your resumé and transcript(s) (if appropriate) to ensure you meet the basic qualification requirements and your application will be reviewed by a SME and rated to determine your level of proficiency. We may interview the best-qualified applicants. After making a tentative job offer, we will conduct any required suitability and/or security background investigation. Please note, you will only receive status updates in the first announcement.", "RequiredDocuments": "It is anticipated that there will be significant interest in the announcement. As a result, the announcement will close at 11:59 p.m. ET on the date of receipt of the 150 application or at 11:59 p.m. ET on 07/28/2024 ; whichever occurs first. Any required documents should be submitted at the time that you apply as documents will not be accepted after the vacancy closes. A complete application includes: 1. A resume: All applicants are required to submit a resume either by creating one in USAJOBS or uploading one of their own choosing. (Cover letters are optional.) Please limit your resume to 5 pages. If more than 5 pages are submitted, your resume will still be accepted, however only the first 5 pages will be reviewed and considered for qualifications and eligibility determination in whether or not the minimum qualifications for the position have been met. To receive full credit for relevant experience, please list the month/date/year and number of hours worked for experience listed on your resume. It is suggested that you preview the online assessment questionnaire, to ensure that your resume thoroughly describes how your skills and experience align to the criteria defined in the \"Qualifications\" section of this announcement and support your responses to the online assessment questionnaire. For resume writing guidance, please visit USAJOBS Resources Center. 2. Vacancy assessment question responses: All applicants are required to complete vacancy question responses by clicking the apply online button of this vacancy announcement. 3. Submission of any required documents identified below, if applicable: Please note that if you do not provide all required information, as specified in this announcement, you may not be considered for this position (or may not receive the special consideration for which you may be eligible). VETERANS' PREFERENCE DOCUMENTATION: If you are claiming veterans preference, please see applicant guide for required documentation. In order to be considered for veterans preference, you must submit all required documentation as outlined in the applicant guide. CAREER TRANSITION ASSISTANCE PLAN (CTAP) OR INTERAGENCY CAREER TRANSITION ASSISTANCE PLAN (ICTAP) DOCUMENTATION: If you are a displaced or surplus Federal employee, click CTAP/ICTAP for eligibility and a detailed list of required documents you must submit in order to be eligible.", "Benefits": "", "BenefitsDisplayDefaultText": true, "OtherInformation": "OTHER INFORMATION: We may select from this announcement or any other source to fill one or more vacancies. The selectee may be required to report to a Departmental Offices worksite on a periodic basis. Requirements to report to the office will vary and can be discussed at the time of interview. This is a non-bargaining unit position. We offer opportunities for flexible work schedules. This position requires that the successful candidate undergo personnel vetting, which includes a background investigation and enrollment upon onboarding into \"Continuous Vetting.\" Enrollment in Continuous Vetting will result in automated record checks being conducted throughout one's employment with Treasury. The successful candidate will also be enrolled into FBI's Rap Back service, which will allow Treasury to receive notification from the FBI of criminal matters (e.g., arrests, charges, convictions) involving enrolled individuals in near real-time. For more information about individual rights, Noncriminal Justice Applicant's Privacy Rights - FBI, FD-258 Privacy Act Statement - FBI, and SEAD-3-Reporting-U.pdf (dni.gov). REASONABLE ACCOMMODATION REQUESTS: If you believe you have a disability (i.e., physical or mental), covered by the Rehabilitation Act of 1973 as amended and Americans with Disabilities Act 1990 as amended, that would interfere with completing the USA Hire Competency Based Assessments, you will be granted the opportunity to request a reasonable accommodation in your online application. Requests for Reasonable Accommodations for the USA Hire Competency Based Assessments and appropriate supporting documentation for Reasonable Accommodation must be received prior to starting the USA Hire Competency Based Assessments. Decisions on requests for Reasonable Accommodations are made on a case-by-case basis. If you meet the minimum qualifications of the position, after notification of the adjudication of your request, you will receive an email invitation to complete the USA Hire Competency Based Assessments. You must complete all assessments within 48 hours of receiving the URL to access the USA Hire Competency Based Assessments, if you received the link after the close of the announcement. To determine if you need a Reasonable Accommodation, please review the Procedures for Requesting a Reasonable Accommodation for Online Assessments here: https://help.usastaffing.gov/Apply/index.php?title=Reasonable_Accommodations_for_USA_Hire OFR's benefits package includes: - Challenging work, opportunities for advancement, federal and non-federal benefits and competitive salaries- Eleven paid holidays, 13 days of sick leave, and 13 to 26 days of vacation time each year- Health insurance plans, paying a substantial amount (up to 75%) of the health insurance premiums, coverage for pre-existing conditions, and no waiting period.-Retirement program, including employer-matching contributions- Supplemental dental and vision coverage at no cost to the employee, long and short term disability coverage, domestic partner subsidies (where applicable), 24-hour business travel accident insurance, and enhanced life insurance coverage- Performance-based merit pay program designed to reward employees for excellent performance- For more information on OFR's benefits, visit: https://www.financialresearch.gov/compensation-and-benefits/- Learn more about Federal benefits programs at: https://help.usajobs.gov/index.php/Pay_and_Benefit", "KeyRequirements": [], "WithinArea": "False", "CommuteDistance": "0", "ServiceType": "01", "AnnouncementClosingType": "03", "AnnouncementClosingTypeOption": "150", "AgencyContactEmail": "doinquiries@fiscal.treasury.gov", "AgencyContactPhone": "304-480-7300", "SecurityClearance": "Not Required", "DrugTestRequired": "False", "AdjudicationType": [], "TeleworkEligible": false, "RemoteIndicator": true}, "IsRadialSearch": false}}, "RelevanceRank": 0}, {"MatchedObjectId": "743747400", "MatchedObjectDescriptor": {"PositionID": "CIO-12080021-DHA-MKT", "PositionTitle": "Information Technology Specialist (Information Security)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/743747400", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/743747400"], "PositionLocationDisplay": "Anywhere in the U.S. (remote job)", "PositionLocation": [{"LocationName": "Anywhere in the U.S. (remote job), United States", "CountryCode": "United States", "CityName": "Anywhere in the U.S. (remote job), United States", "Longitude": 0, "Latitude": 0}], "OrganizationName": "Immigration and Customs Enforcement", "DepartmentName": "Department of Homeland Security", "SubAgency": "Office of the Chief Information Officer", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "", "Code": "1"}], "PositionOfferingType": [{"Name": "", "Code": "15317"}], "QualificationSummary": "Please limit your resume to 5 pages. If more than 5 pages are submitted, only the first 5 pages will be reviewed to determine your eligibility/qualifications. IN DESCRIBING YOUR EXPERIENCE, PLEASE BE CLEAR AND SPECIFIC. WE WILL NOT MAKE ASSUMPTIONS REGARDING YOUR EXPERIENCE. Do not copy and paste the duties, specialized experience, or occupational assessment questionnaire from this announcement into your resume as that will not be considered a demonstration of your qualifications for this position. Basic Qualifications: In order to meet basic qualifications for GS-2210 positions, individuals must have IT-related experience demonstrating each of the competencies defined below: Attention to Detail: Is thorough when performing work and conscientious about attending to detail. Customer Service: Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. Oral Communication: Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. Problem Solving: Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. Your application package should demonstrate this experience. Examples of demonstration include; Attention to Detail: ensuring IT project adherence to regulations and governance policies. Customer Service: generating performance measures, monitoring achievements, reporting variances, responding to data calls and contributing to briefings. Oral Communication: leading a team in the analysis, planning, establishment of requirements, and other related business, management, and technical duties to initiate IT projects including reporting on cost, schedule and performance. Problem Solving: identifying risks and issues and provide recommendations for mitigation or resolution. Specialized Experience: In addition to demonstrating the basic qualifications listed above, applicants must also demonstrate possession of specialized experience. You qualify at the GS-14 level if you possess one (1) year of specialized experience at the GS-13 level that included the following tasks and responsibilities: Coordinating the implementation of IT security programs across platforms. Evaluating IT security incident response policies. Identifying the need for IT security changes based on new technologies or threats. Applying project management principles and methods to ensure a fully compliant infrastructure protection program is implemented throughout the organization. Qualification requirements must be met by the closing date of this announcement. Qualification claims will be subject to verification. National Service Experience (i.e., volunteer experience): Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. Current or Former Political Appointees: The Office of Personnel Management (OPM) must authorize employment offers made to current or former political appointees. If you are currently, or have been within the last 5 years, a political Schedule A, Schedule C, Non-career SES or Presidential Appointee employee in the Executive Branch, you must disclose this information to the Human Resources Office. The Department of Homeland Security encourages persons with disabilities to apply, to include persons with intellectual, severe physical or psychiatric disabilities, as defined by 5 CFR 213.3102(u), and/or Disabled Veterans with a compensable service-connected disability of 30 percent or more as defined by 5 CFR 315.707. Veterans, Peace Corps, VISTA volunteers, and persons with disabilities possess a wealth of unique talents, experiences, and competencies that can be invaluable to the DHS mission. If you are a member of one of these groups, you may not have to compete with the public for federal jobs. To determine your eligibility for non-competitive appointment and to understand the required documentation, click on the links above or contact the Servicing Human Resources Office listed at the bottom of this announcement.", "PositionRemuneration": [{"MinimumRange": "116393.0", "MaximumRange": "183500.0", "RateIntervalCode": "PA", "Description": "Per Year"}], "PositionStartDate": "2023-08-17T00:00:00.0000", "PositionEndDate": "2024-08-16T23:59:59.9970", "PublicationStartDate": "2023-08-17T00:00:00.0000", "ApplicationCloseDate": "2024-08-16T23:59:59.9970", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "View Common Definitions of terms found in this announcement. Organizational Location: These positions are located in the Department of Homeland Security, Immigration and Customs Enforcement, Office of the Chief Information Officer, in Anywhere in the U.S. (remote job). These are non-bargaining unit positions.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "14", "HighGrade": "14", "PromotionPotential": "14", "SubAgencyName": "Office of the Chief Information Officer", "OrganizationCodes": "HS/HSBB", "Relocation": "False", "HiringPath": ["fed-transition", "public"], "TotalOpenings": "1", "AgencyMarketingStatement": "The Department of Homeland Security (DHS) is calling on those who want to help protect American interests and secure our Nation. DHS components work collectively to prevent terrorism; secure borders and our transportation systems; protect the President and other dignitaries; enforce and administer immigration laws, safeguard cyberspace; and ensure resilience to disasters. We achieve these vital missions through a diverse workforce spanning hundreds of occupations. Make an impact; join DHS. The mission of U.S. Immigration and Customs Enforcement (ICE) is to protect America from the cross-border crime and illegal immigration that threaten national security and public safety. ICE focuses on smart immigration enforcement, preventing terrorism, and combating the illegal movement of people and goods. ICE is the principal investigative arm of DHS and the second largest investigative agency in the federal government. Created in 2003, through a merger of the investigative and interior enforcement elements of the U.S. Customs Service and the Immigration and Naturalization Service, ICE has more than 20,000 employees in more than 400 offices in the United States and around the world. ICE is a key component of the DHS layered approach to protecting our nation from a wide range of threats. For additional information about ICE and career opportunities, please visit www.ice.gov.", "TravelCode": "2", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus", "MajorDuties": ["As an Information Technology Specialist (Information Security), you will perform the following duties: Implement high-level security requirements such as those relating from laws, regulations, and presidential directives; Integrate security programs across disciplines; Develop long-range plans for IT security systems that anticipates, identify, evaluate, mitigate, and minimize risks associated with IT systems vulnerabilities; Resolve integration issues related to the implementation of new systems with the existing infrastructure; and Review proposed new systems, networks, and network software designs for potential security risks."], "Education": "", "Requirements": "", "Evaluations": "We will review your resume and supporting documentation to ensure you meet the minimum qualification requirements. The competencies or knowledge, skills, and abilities needed to perform this job are: attention to detail, customer service, oral communication, and problem solving. Direct Hire Authority: These positions will be filled through the Office of Personnel Management's Direct Hire Authority. The \"Rule of Three\", Category Rating and Veterans Preference will not apply to this vacancy. For more information on Direct Hire Authority, please see: OPM Direct Hire Fact Sheet. Veterans: Although the Direct Hire Authority permits hiring without regard to Veterans Preference, applicants who are eligible for Veterans Preference are still encouraged to include that information in their application and submit supporting documentation (i.e. DD-214, or other substantiating documents). This position is not considered scientific/professional. View information on veterans' preference. Interagency Career Transition Assistance Program (ICTAP) Eligibles: If you have never worked for the federal government, you are not ICTAP eligible. View information about ICTAP eligibility on OPM's Career Transition Resources website. To be considered well qualified under ICTAP, you must be placed in the well-qualified category for this position. In addition, you must submit the supporting documents listed under the required documents section of this job announcement. Pursuant to Executive Order 12564, and the DHS Drug-Free Workplace Plan, ICE is committed to maintaining a drug-free workplace and, therefore, personnel in safety- or security-sensitive positions (testing designated positions) are subject to random drug testing. Moreover, other drug testing of employees (e.g., reasonable suspicion drug test) may be conducted in order to ensure a safe and healthy work environment. All applicants tentatively selected for employment at ICE are subject to pre-employment drug testing and a final offer of employment is contingent upon a negative drug test result.", "HowToApply": "To apply for this position, you must complete the Occupational Questionnaire https://apply.usastaffing.gov/ViewQuestionnaire/12080021 and submit the required documentation outlined under the REQUIRED DOCUMENTS section. The complete initial Application must be submitted by 11:59 PM (EST) on 08/16/2024. PLEASE NOTE: If your materials are not received by the closing date, your application will be evaluated solely on the information available and you may not receive full consideration or may not be considered eligible. Also, if you do not provide a valid email address, you may not be notified of the outcome of your application. To begin the process, click the Apply Online button to create an account or log into your existing USAJOBS account. Follow the prompts to complete the occupational questionnaire. Please ensure you click the Submit My Answers button at the end of the process. Note: To check the status of your application or return to a previous or incomplete application, log into your USAJOBS account, select Application Status, and click on the more information link under the application status for this position. Applications and supporting documentation will not be accepted by mail or email. If you need further assistance, contact the Human Resources Office representative listed on this announcement at least one day prior to the closing date for further instructions.", "WhatToExpectNext": "Once you submit your application, you may be referred to the hiring manager for consideration. For Direct Hire Authority positions, we refer lists of qualified applicants when a position becomes available. If selected for an interview, you will hear directly from the hiring manager. Your status will be updated on USAJOBS throughout the process. To check your status, log on to your USAJOBS account, click on \"Application Status,\" and then click \"More Information.\" We expect to make a job offer within 180 days after the deadline for applications. If you are selected, we will conduct a suitability/security background investigation. View more information on applying for federal employment. Any offers of employment made pursuant to this announcement will be consistent with all applicable authorities, including Presidential Memoranda, Executive Orders, interpretive U.S. Office of Management and Budget (OMB) and U.S. Office of Personnel Management (OPM) guidance, and Office of Management and Budget plans and policies concerning hiring. These authorities are subject to change.", "RequiredDocuments": "Resume showing relevant experience, education and training. Work experience should include: job title, duties, employer's name, employer's telephone number, employer's address, starting and ending dates (MM/YY), hours worked per week, and indicate whether or not we may contact your current supervisor. Please limit your resume to 5 pages. If more than 5 pages are submitted, only the first 5 pages will be reviewed to determine your eligibility/qualifications (for more information, see the Frequently Asked Questions about the Five-Page Resume Limit). Are you a veteran? Submit Member Copy 4 of your DD-214 or other (Certificate of Release or Discharge from Active Duty) or notice form. Those applying for 10-Point preference must fill out the SF-15 and provide documentation that demonstrates preference eligibility. If applying based on eligibility under the Veterans Opportunity to Work (VOW) Act, you must submit certification from the Armed Forces that you will be discharged or released from active duty within 120 days from the date on the certification. This must indicate your dates of service, your rank, and confirm that you will be separated under honorable conditions. View more veterans' information. Are you claiming special priority selection rights under the Interagency Career Transition Plan (ICTAP)? If so, submit a copy of your agency notice, a copy of your most recent performance rating, and a copy of your most recent Notification of Personnel Action (SF-50) noting your current position, grade level, and duty location. Are you a current or former federal employee? Submit a copy of your most recent SF-50, Notification of Personnel Action. Are you a current or former political Schedule A, Schedule C, Non-career SES or Presidential Appointee employee? Submit a copy of your applicable SF-50, along with a statement that provides the following information regarding your most recent political appointment: Position title, type of appointment (Schedule A, Schedule C, Non-career SES, or Presidential Appointee), agency and beginning and ending dates of appointment.", "Benefits": "", "BenefitsUrl": "https://www.dhs.gov/homeland-security-careers/benefits", "BenefitsDisplayDefaultText": true, "OtherInformation": "This announcement is to create an inventory of qualified applicants. This position will remain open until 08/13/2024. Cut-off dates for referral to hiring managers for selection consideration will be established as needed by the agency. Due to high volume of applicants, not all applicants will be considered. Note: One or more positions may be filled using this vacancy announcement. Applying to this announcement certifies that you give permission for DHS to share your application with others in DHS for similar positions. Salary: The salary range indicated in this announcement reflects the lowest and highest potential salaries for this position. The actual salary range will be based on the applicable locality pay for the selected duty location. General Schedule locality pay tables may be found under Salaries & Wages. This position is at the full performance level. E-Verify: DHS uses E-Verify, an Internet-based system, to confirm the eligibility of all newly hired employees to work in the United States. Learn more about E-Verify, including your rights and responsibilities. Suitability: If you receive a conditional offer of employment for this position, you will be required to complete an Optional Form 306, Declaration for Federal Employment, and to sign and certify the accuracy of all information in your application, prior to entry on duty. False statements on any part of the application may result in withdrawal of offer of employment, dismissal after beginning work, fine, or imprisonment. Financial Disclosure: If you are hired, you may be required to complete a Confidential Financial Disclosure Report (OGE Form 450) within 30 days after appointment. Background Investigation: To ensure the accomplishment of our mission, DHS requires every employee to be reliable and trustworthy. To meet these standards, all selected applicants must undergo and successfully obtain and maintain a background investigation for Secret clearance as a condition of placement into this position. This may include a credit check, a review of financial issues such as delinquency in the payment of debts, child support and/or tax obligations, as well as certain criminal offenses and illegal use or possession of drugs. Benefits: DHS offers competitive salaries and an attractive benefits package, including: health, dental, vision, life, and long-term care insurance; retirement plan; Thrift Savings Plan [similar to a 401(k)]; Flexible Spending Account; Employee Assistance Program; personal leave days; and paid federal holidays. Other benefits may include: flexible work schedules; telework; tuition reimbursement; transportation subsidies; uniform allowance; health and wellness programs; and fitness centers. DHS is committed to employee development and offers a variety of employee training and developmental opportunities. For more information, go to the DHS Careers website and select \"Benefits.\" Disabled veteran leave will be available to any Federal employee hired on or after November 5, 2016, who is a veteran with a service-connected disability rating of 30 percent or more. A student loan repayment incentive may be available, in which case a service agreement will be required.", "KeyRequirements": [], "WithinArea": "False", "CommuteDistance": "0", "ServiceType": "01", "AnnouncementClosingType": "01", "AgencyContactEmail": "Megan.K.Taylor@ice.dhs.gov", "SecurityClearance": "Secret", "DrugTestRequired": "True", "PositionSensitivitiy": "Critical-Sensitive (CS)/High Risk", "AdjudicationType": ["Suitability/Fitness"], "TeleworkEligible": false, "RemoteIndicator": true}, "IsRadialSearch": false}}, "RelevanceRank": 0}, {"MatchedObjectId": "797695600", "MatchedObjectDescriptor": {"PositionID": "JDP-12462183-24-KJ", "PositionTitle": "IT Specialist (INFOSEC)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/797695600", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/797695600"], "PositionLocationDisplay": "Anywhere in the U.S. (remote job)", "PositionLocation": [{"LocationName": "Anywhere in the U.S. (remote job), United States", "CountryCode": "United States", "CityName": "Anywhere in the U.S. (remote job), United States", "Longitude": 0, "Latitude": 0}], "OrganizationName": "Department of Homeland Security - Agency Wide", "DepartmentName": "Department of Homeland Security", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "", "Code": "1"}], "PositionOfferingType": [{"Name": "", "Code": "15320"}], "QualificationSummary": "Qualifications required: GS-13 level applicants should demonstrate the following in their application: Attention to Detail: ensuring IT project/system adherence to regulations and governance policies. Customer Service: generating IT security performance measures, monitoring achievements, reporting variances, responding to data calls and contributing to briefings. Oral Communication: leading a team in the analysis, planning, establishment of IT security requirements, and other related business, management, and technical duties. Problem Solving: identifying IT security risks and issues and providing recommendations for mitigation or resolution. GS-14 applicants should demonstrate the following in their application in addition to those listed above: Coordinating the implementation of IT security programs across platforms. Evaluating IT security incident response policies. Identifying the need for IT security changes based on new technologies or threats Applying project management principles and methods to ensure fully compliant infrastructure, platform, and application protection programs are implemented throughout the organization. Please read the following important information to ensure we have everything we need to consider your application: It is your responsibility to ensure that you submit appropriate documentation prior to the closing date. Your resume serves as the basis for qualification determinations and must highlight your most relevant and significant experience as it relates to this Joint Duty assignment opportunity announcement. Be clear and specific when describing your work history since human resources cannot make assumptions regarding your experience. Your application will be rated based on your resume. Please ensure EACH work history includes ALL of the following information: Job Title (Include series and grade of Federal Job) Duties (Be specific in describing your duties) Name of Federal agency Supervisor name, email, and phone number Start and end dates including month and year (e.g. June 2007 to April 2008)", "PositionRemuneration": [{"MinimumRange": "88520.0", "MaximumRange": "135987.0", "RateIntervalCode": "PA", "Description": "Per Year"}], "PositionStartDate": "2024-06-27T15:30:56.0000", "PositionEndDate": "2024-07-26T23:59:59.9970", "PublicationStartDate": "2024-06-27T15:30:56.0000", "ApplicationCloseDate": "2024-07-26T23:59:59.9970", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "1-year non-reimbursable assignment Office of the Chief Human Capital Officer (OCHCO) IT Specialist (INFOSEC) Series Requested: 2210 Security Clearance: No Virtual/Remote: Yes Only current, full-time federal employees are eligible. Resumes are reviewed every 30 days until selection/closing date. This is a Detail, not a Developmental Rotation. You will be expected to perform as an incumbent in this position. Supervisory approval form must be signed. Read the entire announcement.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "13", "HighGrade": "14", "PromotionPotential": "None", "OrganizationCodes": "HS/HS00", "Relocation": "False", "HiringPath": ["fed-competitive", "fed-excepted"], "MCOTags": ["Joint Duty Program"], "TotalOpenings": "1", "AgencyMarketingStatement": "DHS is calling on those who want to help protect American interests and secure our Nation. DHS Components work collectively to prevent terrorism; secure borders and our transportation systems; protect the President and other dignitaries; enforce and administer immigration laws; safeguard cyberspace; and ensure resilience to disasters. The DHS Joint Duty Program (JDP) is an intra- and inter-departmental program which offers civilian personnel professional and developmental opportunities. Joint Duty Assignments (JDAs) enhance operations and mission execution through unity of effort and collaboration. The DHS JDP is a human capital program initiative which is managed by OCHCO at DHS headquarters. The DHS JDP's purpose is two-fold: to encourage and to facilitate assignments of DHS personnel to other DHS components as well as outside agencies. The purpose of JDAs is to gain multi-component, multi-faceted experience focused on cross-cutting DHS and Federal-wide operations to enhance performance of the individual, the organizations, and the Department. JDAs are for a period not to exceed 1 year and do not qualify for Joint Duty credit. The DHS JDP covers current Federal employees at the GS-13 through GS-15 grade levels and equivalent. The DHS JDP does not apply to members of the military service or contractors. JDAs do not offer Temporary Promotions.", "TravelCode": "0", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus", "MajorDuties": ["Performs as an Information System Security Officer (ISSO)for one or more Human Resources Information Technology (HRIT) systems in the DHS Headquarters Office of the Human Capital Officer (OCHCO). Under the guidance of an Information System Security Manager (ISSM), assist with: Developing, integrating, and updating system security measures that provide confidentiality, integrity, availability, authentication, and non-repudiation. Identifying threats and vulnerabilities of computer system(s) and developing security risk profiles. Developing system testing and validation procedures and documentation. Addressing Plans of Action and Milestones (POA&Ms) identified in system security plans and vulnerability scans."], "Education": "EDUCATIONAL SUBSTITUTION: There is no educational substitution for this position.", "Requirements": "", "Evaluations": "We will review your resume and supporting documentation to ensure you meet the basic qualification requirements. If you meet the minimum qualifications, your experience, education, and training will be rated using a job questionnaire based on the competencies or knowledge, skills, and abilities needed to perform this Joint Duty Assignment. If you are among the best qualified, you may be referred to the hiring manager for consideration and may be called for an interview. After reviewing your resume and supporting documentation, a determination will be made. You must submit the supporting documents listed under the required documents section of this announcement. Note: DHS continues to take necessary steps to keep our workforce safe amid the COVID-19 pandemic. If you receive a final Joint Duty Assignment offer to onboard, please complete the onboarding requirements and/or forms and submit them electronically in an expeditious manner. Your start date may be delayed if the action above is not completed.", "HowToApply": "All applicants are encouraged to apply online. To apply for this position, you must complete the questionnaire and submit the documentation specified in the Required Documents section. The complete application package must be submitted by 11:59 PM (ET) on 07/26/2024 to receive consideration. To begin, click Apply Online to create a USA JOBS account or log in to your existing account. Follow the prompts to select your USA JOBS resume and other supporting documents, and complete the questionnaire. Click Submit My Answers to submit your application package. NOTE: It is your responsibility to ensure your responses and appropriate documentation is submitted prior to the closing date. To verify your application is complete, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link, and then select the more information link for this position. The Application page will display the status of your application, the documentation received and processed, and any correspondence the agency has sent related to this application. Your uploaded documents may take several hours to clear the virus scan process. To return to an incomplete application, log into your USAJOBS account and click Update Application in the vacancy announcement. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete.", "WhatToExpectNext": "Once you submit your application, we will assess your experience and training, identify the best qualified applicants, and refer those applications to the selecting official for further consideration and a possible interview. We will notify you by email at various stages in the process. Your status will also be updated on USAJOBS throughout the process. To check your status, log on to your USAJOBS account, click on \"Application Status,\" and then click \"More Information.\" We expect to make a final JDA offer within 90 days after the deadline for applications. If you are selected, we will conduct a suitability/security background investigation. Telework: Telework eligibility is based on the needs of the office and is subject to change. Additional information pertaining to your interest and availability for this position may be needed after the closing date of the Joint Duty Assignment vacancy announcement; therefore, a timely response to these requests must be adhered to in order to remain in consideration.", "RequiredDocuments": "1. Resume: Do not include any personally identifiable information (PII) i.e., home address, social security number, or date of birth. Your resume must clearly demonstrate you have experience which meets the requirements of this position as outlined in the \"Qualifications\" section. 2. SF-50: Submit a copy of your official SF-50 (no text version) or other official \"Notification of Personnel Action\" document which shows the following information: Your appointment in the Federal service Tenure Grade and Step Full performance level If your SF-50(s) does not provide the information needed to make a final determination for qualification, you will be found ineligible for the position. 3. DHS Joint Duty Assignment Application Form signed by your supervisor. Please click on the following link to access the required form DHS Form 250-02.", "Benefits": "", "BenefitsDisplayDefaultText": true, "OtherInformation": "**DHS does not offer any additional benefits beyond that which the Federal employee is already receiving. If the position requires a security clearance, employees must have a SECRET or TOP SECRET clearance to placement AND must maintain that level of clearance while performing in the position. Selected applicants for a JDA are requested to fulfill the items below during the JDA: Complete the DHS Training Course 15 days prior to the arrival to the JDA. Complete the DHS Joint Duty Assignment Progress Plan to include: Phase 1: Establish assignment objectives within the first 30 days of the JDA. Phase 2: Complete a self-assessment of the duties performed at the mid-point of the JDA. Phase 3: Complete a final review within the last 30 days of the JDA.", "KeyRequirements": [], "WithinArea": "False", "CommuteDistance": "0", "ServiceType": "01", "AnnouncementClosingType": "01", "AgencyContactEmail": "JointDutyProgramOffice@hq.dhs.gov", "SecurityClearance": "Not Required", "DrugTestRequired": "False", "AdjudicationType": [], "TeleworkEligible": false, "RemoteIndicator": true}, "IsRadialSearch": false}}, "RelevanceRank": 0}, {"MatchedObjectId": "800531100", "MatchedObjectDescriptor": {"PositionID": "TMCO - OCTO-24-12345835-MP", "PositionTitle": "IT SPECIALIST (SYSANALYSIS/DATAMGT)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/800531100", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/800531100"], "PositionLocationDisplay": "Anywhere in the U.S. (remote job)", "PositionLocation": [{"LocationName": "Anywhere in the U.S. (remote job), United States", "CountryCode": "United States", "CityName": "Anywhere in the U.S. (remote job), United States", "Longitude": 0, "Latitude": 0}], "OrganizationName": "Patent and Trademark Office", "DepartmentName": "Department of Commerce", "SubAgency": "Information Technology Transformation Office", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "", "Code": "1"}], "PositionOfferingType": [{"Name": "", "Code": "15317"}], "QualificationSummary": "You must meet the United States Office of Personnel Management's (OPM) qualification requirements (including specialized experience and/or educational requirements) for the advertised position. You must meet all eligibility and qualifications requirements by the closing date of the job announcement. OPM Qualifications Standards are available at Information Technology (IT) Management Series 2210 (Alternative A). Specialized Experience is experience that has equipped applicants with the particular knowledge, skills and abilities to successfully perform the duties of the position, and that is typically in or related to the position to be filled. To be creditable, specialized experience must have been equivalent to at least the next lower grade level in the federal service. For this position, the next lower grade level is a GS-12. Specialized experience for this position includes: Experience designing, upkeep, configuration, and troubleshooting cloud based, low code application/tools such as Microsoft Power Platform and ServiceNow. Experience anticipating, identifying, and solving complex application problems including technical issues, bugs, errors, or performance issues, or non-technical issues like stakeholder dissatisfaction. Experience conducting data extracts from a SaaS application to analyze trends and relationships utilizing reporting tools such as Power BI. Experience of Enterprise Architecture (EA) principles, tool, concepts and methods to align information technology (IT) to security mission needs. The applicant must possess the following Information Technology related experience demonstrating each of the four competencies listed below: Attention to Detail - Is thorough when performing work and conscientious about attending to detail. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.", "PositionRemuneration": [{"MinimumRange": "117962.0", "MaximumRange": "153354.0", "RateIntervalCode": "PA", "Description": "Per Year"}], "PositionStartDate": "2024-07-18T10:03:59.1070", "PositionEndDate": "2024-08-01T23:59:59.9970", "PublicationStartDate": "2024-07-18T10:03:59.1070", "ApplicationCloseDate": "2024-08-01T23:59:59.9970", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "Join the USPTO Enterprise Architecture team in the Office of the Chief Information Officer (OCIO) and help drive the delivery of the USPTO's next product utilizing ServiceNow. Be at the front of the work that provides the foundation for the automation, risk assessment and compliance for all USPTO's IT assets. Work in a challenging, multi-cloud environment to define and deliver world class products to support the mission of the USPTO.", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "13", "HighGrade": "13", "PromotionPotential": "13", "SubAgencyName": "Information Technology Transformation Office", "OrganizationCodes": "CM/CM56", "Relocation": "False", "HiringPath": ["fed-transition", "fed-competitive", "disability", "mspouse", "peace", "vet"], "TotalOpenings": "1", "AgencyMarketingStatement": "Come work for the Patent and Trademark Office, we have been ranked as one of the best places to work in the federal government! The U.S. Patent and Trademark Office (USPTO) has been serving the economic interests of America for more than 200 years. We are responsible for granting US intellectual property rights for patents and trademarks. The USPTO is headquartered in Alexandria, Virginia, and has over 12,000 employees. For more information about the USPTO, please visit the USPTO Jobs Website.", "TravelCode": "0", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus", "MajorDuties": ["The physical worksite for this position is located in Alexandria, Virginia.This position is eligible for fully remote work anywhere within 50 United States, District of Columbia, and Puerto Rico. There is no reporting requirement. The duty station is the authorized telework location (typically your home address) and locality pay is adjusted appropriately. If selected for an interview, applicants are encouraged to discuss telework options and eligibility specific to the position in which they applied with the hiring manager. This is the ideal position for you if... You would like to provide your expertise in order to identify, capture, and manage new requirements and/or changes to the process for storing all aspects of IT inventory in Configuration Items (CI). You enjoy developing workflows and scripts within a \"low-code/no-code\" platform. You are able to strategically advise product teams on software and hardware inventory needs as well as new technologies, and recommend modifications to current software and hardware to support Enterprise Architecture Division products and tools. You are able to use your skills as a Scrum Master in a DevSecOps product team. You enjoy collaborating with all stakeholders to ensure secure product deliverables."], "Education": "Education may not be substituted for experience at this grade level.", "Requirements": "", "Evaluations": "Your resume, optional cover letter and supporting documentation will be reviewed to determine if you meet the minimum qualification requirements for the position. All applicants who meet the minimum qualification requirements, as defined in the job opportunity announcement, will be referred for selection consideration. Preference eligibles are encouraged to submit their supporting documentation (DD-214 stating disposition of discharge or character of service, VA letter, SF-15, etc.). Your resume will be evaluated based on evidence of your ability to demonstrate possession of any specialized experience and how well your background and experience relates to the self-assessment questions in the job announcement. Responses to job questions that are not fully supported by the information in your resume may result in adjustments to your rating. Any experience claimed in a cover letter should be substantiated by information contained in your resume. A HR Representative will validate the qualifications of those candidates eligible to be referred to the hiring official. The scored occupational questionnaire will evaluate you on the following competencies. Please do not provide a separate written response. Configuration Management Information Technology Architecture Information Technology Product Management Risk Management Written and Oral Communication Your responses to the self-assessment questions serve as the basis for your initial rating. You will receive a numerical score based on your responses to these questions. Next, your responses will be evaluated by a Human Resources Specialist and/or a subject matter expert against the information provided in your resume and optional cover letter. Your resume must support your answers to the self-assessment questions, or your score may be adjusted or lowered accordingly which may affect your overall final rating. The best qualified candidates will be identified for referral to the hiring manager and may be invited for an interview. If referred all relevant documents submitted with your application package will be forwarded to the selecting official, due weight shall be given to performance appraisals and awards in accordance with 5 CFR § 335.103(b)(3), during the interview/selection process conducted by the hiring manager. Falsifying your background, education, and/or experience is cause for not hiring you or for changing your scored responses to questions you've answered, which may affect your overall final score. Please click the link below to preview the Assessment Questionnaire: https://apply.usastaffing.gov/ViewQuestionnaire/12345835 Please note that a complete application is required for consideration. (Please review the \"Required Documents\" section of this job announcement to see what must be included in a complete application.)", "HowToApply": "This vacancy is also being announced under the USPTO's delegated examining procedures for non-status applicants under Job Announcement Number TMCO - OCTO-24-12479881-DE. Please review that announcement to determine if you are eligible for consideration under that announcement. You MUST apply online. If you experience difficulties with the application process or do not have access to a computer, please contact the HR Specialist listed as the point of contact before the closing date of this job announcement. If you are a new user to the USAJobs Site and have never registered for an account, you will first need to create an account profile with your basic contact information and a resume to begin applying. You must be a registered USAJobs user AND you must be signed-in to your account in order to apply for this position. For help setting up an account or for general help using USAJobs, go to USAJobs Help Page. Once you have gathered all of the required information and are ready to begin the application process, click the \"APPLY\" button at the right side of the page. You will then be directed away from USAJobs to the Department of Commerce application site for USPTO. You must click \"Submit\" at the end of the application process to send your application for consideration. To return to your saved application, log in to your USAJOBS account at http://www.usajobs.gov/ and click on \"Applications.\" Click on the position title, then select \"Update Application.\" If you experience any difficulties with the application site, help is available! OPM has a Help feature on each page. Use this option when you need assistance. All required supporting documents will be collected electronically via the USAJobs \"Saved Documents\" feature. Personally Identifiable Information (PII) Personally Identifiable Information (PII) is defined as information that can be traced back to a specific individual and potentially compromise their security or privacy. Examples of PII include: date of birth, Social Security Number, and place of birth. Please ensure that you have removed all Personally Identifiable Information from all documents prior to submitting or uploading your applications material.", "WhatToExpectNext": "You will receive a notice generated by the USAJobs System when you have successfully submitted your application. You will be notified of your application status through USAJOBS at four points during the hiring process, as applicable. You can check the status of your application by accessing the USAJOBS website at http://usajobs.gov/ and clicking on \"Track Your Online Application.\" The four points of notification are: 1. Application Received or Application Incomplete; 2. Minimum Qualification Requirement Met or Minimum Qualification Requirement Not Met; 3. Eligible (Application Referred to the Selecting Official) or Eligible (Application Not Referred to the Selecting Official); and 4. Selected or Not Selected After all application packages have been received, we will review your application and transcript(s) (if you are qualifying based on education) to ensure you meet the basic qualification requirements. We will evaluate each applicant who meets the basic qualifications on the information provided and you may be contacted for follow-up supplemental documentation. It is the applicant's responsibility to provide any supplemental documents or information requested by the Office of Human Resources within the allocated timeframes. You will be required to submit official documentation prior to appointment. The agency will then verify the information provided on your application (i.e., degree, veterans' preference, disability, etc.). You can check the status of your application by logging into USAJOBS. You may also sign up to receive automatic emails anytime the status of your application has changed by logging into your USAJobs Account, editing your profile and changing the \"Notification Settings\" to indicate that you want to be notified by email when the status changes. Information regarding the status of your application should be updated in the system within 2 weeks after the closing date of this job announcement. The United States Patent and Trademark Office offers a comprehensive benefits package that includes, in part, paid vacation, sick leave, paid holidays, life insurance, health benefits, and participation in the Federal Employees Retirement System. Alternative Work Schedule (AWS) and Telework Program are available to eligible employees.", "RequiredDocuments": "A complete application consists of: A resume or any other written format you choose to describe your job-related qualifications; optional cover letter: Your resume should indicate your citizenship and should list your educational and work experience including titles, salary, employment dates, duties, experience and how it relates to the specialized experience in the job announcement. Supporting Documents: 1. Notification of Personnel Action (SF-50) - For current and/or former Federal employees, your status eligibility and highest permanent grade/step/salary held in the Federal service will be validated with a copy of your most recent SF-50, \"Notification of Personnel Action\" so that we may verify your time-in-grade. 2. Performance Appraisal - Recent performance appraisal with supervisor's signature showing the official final rating of record and copy of incentive award(s). In cases where the performance appraisal is incomplete or unavailable, applicants may provide explanation of the reasons. 3. Veterans Employment Opportunities Act (VEOA) documents - If you are a Veteran claiming eligibility under VEOA, you will be asked to submit a copy of your DD-214. Veterans must include dates of military service on their application materials and submit a copy of each Certificate of Release or Discharge from Active Duty, DD-214. For more info, please visit Special Appointing Authorities for Veterans. 4. CTAP applicants MUST submit the following documents: 1. A copy of your RIF separation notice, notice of proposed removal for declining a directed geographic relocation outside of the local commuting area; a Certificate of Expected Separation (CES); or certification that you are in a surplus organization or occupation (this could be a position abolishment letter, a notice of eligibility for discontinued service retirement, or similar notice); 2. A copy of your SF-50 \"Notification of Personnel Action\", noting current position, grade/band level, and duty location; 3. A copy of your latest performance appraisal including your rating; and 4. Any documentation from your bureau/operating unit that shows your current promotion potential. 5. ICTAP applicants MUST submit the following documents: 1. A copy of your RIF separation notice, notice of proposed removal for declining a directed geographic relocation outside of the local commuting area, notice of disability annuity termination, certification from your former agency that it cannot place you after your recovery from a work-related compensable injury; or certification from the National Guard Bureau or Military Department that you are eligible for disability retirement; 2. A copy of your SF-50 \"Notification of Personnel Action\", documenting your RIF separation, noting your position, grade/band level, and duty location, and/or Agency certification of inability to place you through RPL, etc.; 3. A copy of your latest performance appraisal including your rating; and 4. Any documentation from your agency that shows your current promotion potential. 6. Special Appointing Authorities - If you are applying under a special appointing authority (i.e., Schedule A, disabled veterans, or certain military spouses), you will be asked to submit documents showing eligibility to non-competitively apply under Merit Assignment announcements. Please indicate the type of special appointment you are seeking on your application. For more info on non-competitive appointments and supporting documents, please visit Federal Employment of People with Disabilities or Feds Hire Vets - Special Hiring Authorities. You can upload your documents when you register or update your information on the Dept. of Commerce site which you access through the USAJobs site. Your application and all required documents must be received by 11:59 pm ET on the closing date of this job announcement. NOTE: The preceding documents requirement are based on job requirements and individual applicant eligibility. Not all documents are applicable to all applicants; if you are unsure which documents apply to you, contact the HR Specialist listed on this announcement.", "Benefits": "", "BenefitsUrl": "https://www.usajobs.gov/Help/working-in-government/benefits/", "BenefitsDisplayDefaultText": true, "OtherInformation": "Time-in-grade/band requirements must be met by the closing date of the announcement unless eligible for special hiring authority, reinstatement eligible, non-current Federal employee applying as a VEOA eligible which do not require time-in-grade/band. If you are a male applicant born after December 31, 1959, you must certify that you have registered with the Selective Service System. If you are exempt from registration under Selective Service Law, you must provide appropriate proof of exemption. Please visit the Selective Service System website for more information. This is a Bargaining Unit position and represented by The National Treasury Employees Union, Chapter 243 (NTEU 243). This is a Public Trust position and has a risk level designation of \"moderate\". Background Investigation - If selected for this position, you may be required to complete a Declaration for Federal Employment (OF-306), which includes a fingerprint and credit check, to determine your suitability for Federal employment and to authorize a background investigation. The USPTO participates in E-Verify. For more information on E-Verify, please visit the Department of Homeland Security Website. All Federal employees are required to have Federal salary payments made by direct deposit to a financial institution of their choice. Relocation Expenses are not authorized and will not be paid. CTAP and ICTAP candidates will be eligible for selection priority if it is determined that they have exceeded the minimum qualifications for the position by attaining at least a \"well qualified\" rating of 85 out of 100. Information about CTAP and ICTAP eligibility is on the Office of Personnel Management's Career Transition Resources website at: OPM CTAP/ICTAP. CTAP/ICTAP documentation requirements are listed in the 'Required Documents' section of this announcement. More than one selection may be made from this announcement if additional identical vacancies in the same title, series, grade, and unit occur within 90 days from the date the certificate was issued. All application materials become the property of the United States Patent and Trademark Office. USPTO Job Applicants requiring reasonable accommodation for any part of the application and hiring process should request accommodation(s) from the USPTO at http://www.uspto.gov/accommodation. The United States Patent and Trademark Office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, retaliation, parental status, military service, or other non-merit factors. If you believe that you have been discriminated against and would like to file an EEO complaint, you must do so within 45 days of the date of the alleged discriminatory act. Claims of employment discrimination must be submitted to the attention of the USPTO's Office of Equal Employment Opportunity & Diversity via email (oeeod@uspto.gov) or phone (571-272-8292).", "KeyRequirements": [], "WithinArea": "False", "CommuteDistance": "0", "ServiceType": "01", "AnnouncementClosingType": "03", "AnnouncementClosingTypeOption": "250", "AgencyContactEmail": "sydney.williams@uspto.gov", "AgencyContactPhone": "571-272-3393", "SecurityClearance": "Not Required", "DrugTestRequired": "False", "PositionSensitivitiy": "Noncritical-Sensitive (NCS)/Moderate Risk", "AdjudicationType": ["Credentialing", "Suitability/Fitness"], "TeleworkEligible": false, "RemoteIndicator": true}, "IsRadialSearch": false}}, "RelevanceRank": 0}, {"MatchedObjectId": "800344900", "MatchedObjectDescriptor": {"PositionID": "CARX-24-12464933-CCo-DH", "PositionTitle": "IT Specialist (DataMgt)", "PositionURI": "https://www.usajobs.gov:443/GetJob/ViewDetails/800344900", "ApplyURI": ["https://www.usajobs.gov:443/GetJob/ViewDetails/800344900"], "PositionLocationDisplay": "Anywhere in the U.S. (remote job)", "PositionLocation": [{"LocationName": "Anywhere in the U.S. (remote job), United States", "CountryCode": "United States", "CityName": "Anywhere in the U.S. (remote job), United States", "Longitude": 0, "Latitude": 0}], "OrganizationName": "Deputy Assistant Secretary for Information and Technology", "DepartmentName": "Department of Veterans Affairs", "SubAgency": "Financial Services Center; Financial Technology Service", "JobCategory": [{"Name": "Information Technology Management", "Code": "2210"}], "JobGrade": [{"Code": "GS"}], "PositionSchedule": [{"Name": "", "Code": "1"}], "PositionOfferingType": [{"Name": "", "Code": "15317"}], "QualificationSummary": "To qualify for this position, applicants must meet all requirements by the closing date of this announcement, 07/26/2024. Selective Placement Factor: This position includes a skill, knowledge, ability or other worker characteristic basic to -and essential for- satisfactory performance of the job. Selective Placement Factors are a prerequisite to appointment and represent minimum requirements for a position. Applicants who do not meet it are ineligible for further consideration. Evidence of the Selective Placement Factor must be reflected in your resume. The Selective Placement Factor for this position is: Experience with Power BI and IT project management. AND You may qualify based on your experience as described below. Individual Occupational Requirements (Alternative A): Basic Requirements Experience - Experience must be IT related; the experience may be demonstrated by paid or unpaid experience and/or completion of specific, intensive training (for example, IT certification), as appropriate. For all positions individuals must have IT-related experience demonstrating each of the four competencies listed below. The employing agency is responsible for identifying the specific level of proficiency required for each competency at each grade level based on the requirements of the position being filled. Attention to Detail - Is thorough when performing work and conscientious about attending to detail. Customer Service - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services. Oral Communication - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately. Problem Solving - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations. AND Specialized Experience: You must have one year of specialized experience equivalent to at least the next lower grade GS-11 in the normal line of progression for the occupation in the organization. Specialized experience is experience that has equipped the applicant with the particular competencies/knowledge, skills, and abilities to successfully perform the duties of the position and is typically in or related to the work of the position to be filled. Such experience is typically gained in the IT field or through the performance of work where the primary concern is IT. Specialized experience is defined as experience planning, assessing, and improving the effectiveness of financial technology systems, through conception, specification, analysis, planning, development, installation, testing, modification, and use of data handling and computing systems. Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religions; spiritual; community; student; social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience. Per Office of Personnel Management General Schedule Qualification Policies, federal employees are assumed to have gained experience by performing duties and responsibilities appropriate for their official series and grade level as described in their position description. Experience that would not normally be part of the employee's position is creditable when documented by satisfactory evidence (e.g., a memorandum from the manager, human resources director, or official documentation such as SF-52, SF-50 documenting an official detail/assignments, or other comparable documentation). The documentation must indicate whether the employee performed the duties full time or, if part-time, the percentage of times the employee performed the additional duties. To receive credit for experience in your resume that is not within the official series and grade level of your position, you must provide official documentation of such experience as indicated above. Note: A full year of work is considered to be 35-40 hours of work per week. Part-time experience will be credited on the basis of time actually spent in appropriate activities. Applicants wishing to receive credit for such experience must indicate clearly the nature of their duties and responsibilities in each position and the number of hours a week spent in such employment. For more information on these qualification standards, please visit OPM's web site at http://www.opm.gov/qualifications/standards/indexes/alph-ndx.asp.", "PositionRemuneration": [{"MinimumRange": "74441.0", "MaximumRange": "96770.0", "RateIntervalCode": "PA", "Description": "Per Year"}], "PositionStartDate": "2024-07-19T00:00:00.0000", "PositionEndDate": "2024-07-26T23:59:59.9970", "PublicationStartDate": "2024-07-19T00:00:00.0000", "ApplicationCloseDate": "2024-07-26T23:59:59.9970", "PositionFormattedDescription": [{"Label": "Dynamic Teaser", "LabelDescription": "Hit highlighting for keyword searches."}], "UserArea": {"Details": {"JobSummary": "The position is located within the Department of Veterans Affairs, Financial Services Center (FSC), IT Business Operations Division (ITBOD), IT Strategy & Integration (ITBOD/SI) where the incumbent serves as an IT Specialist in a Data Analyst role under the supervision of the Branch Chief, ITBOD/SI in Financial Technology Services (FTS).", "WhoMayApply": {"Name": "", "Code": ""}, "LowGrade": "12", "HighGrade": "12", "PromotionPotential": "None", "SubAgencyName": "Financial Services Center; Financial Technology Service", "OrganizationCodes": "VA/VAEB", "Relocation": "False", "HiringPath": ["fed-transition", "public"], "MCOTags": ["01", "TechToGov"], "TotalOpenings": "2", "AgencyMarketingStatement": "OUR MISSION: To fulfill President Lincoln's promise \"To care for those who have served in our nation's military and for their families, caregivers, and survivors\" - by serving and honoring the men and women who are America's Veterans. How would you like to become a part of a team providing compassionate whole health care to Veterans? The VA has adopted Core Values and Characteristics that apply universally across the Department. The five Core Values define \"who we are,\" our culture, and how we care for Veterans, their families and other beneficiaries. The Values are Integrity, Commitment, Advocacy, Respect and Excellence (\"I CARE\"). As a VA professional, your opportunities are endless. With many openings in the multiple functions of VA, you will have a wide range of opportunities and leadership positions at your fingertips. DIRECT HIRE AUTHORITY: This position is being filled using Direct-Hire Authority (5 CFR 337.205) for this occupation.", "TravelCode": "1", "ApplyOnlineUrl": "https://apply.usastaffing.gov/Application/Apply", "DetailStatusUrl": "https://apply.usastaffing.gov/Application/ApplicationStatus", "MajorDuties": ["This is a bargaining unit position. The initial application review cut-off for this job announcement is 50 applications. The first 50 applications received will be considered first. Applications received after the initial cut-off number (50 applications) may not receive consideration unless otherwise requested by management. If management requests additional certificates, applicants will continue to be reviewed in groups of 50 in the order they applied. Note: Submitting multiple applications will change the order in which your application is reviewed. This position is primarily aligned to the following NICE Cybersecurity Workforce Framework work roles: 422- Data Analyst For more information about these work roles, where they fit within the larger Cyber Workforce, and how they can support your unique career journey, please visit the Cyber Career Pathways tool on the National Initiative for Cybersecurity Careers and Studies website: https://niccs.us-cert.gov/workforce-development/cyber-career-pathways VA offers a comprehensive total rewards package: VA Total Rewards Work Schedule: Mon - Fri 6:30 am - 3:00 pm Compressed/Flexible Schedule: Available Telework: Not applicable, this is a remote position Duty Location Status: Will work remotely from home Position Description Title/PD#: IT Specialist (DataMgt)/ PD18651A Relocation/Recruitment Incentives: Not Authorized Permanent Change of Station (PCS): Not Authorized Financial Disclosure Report: Not Required Physical Demands: The work is sedentary. No special physical demands are required to perform the work. Some work may require walking and standing in conjunction with travel and attendance at meetings and conferences away from the work site. Work may also require carrying light items, lifting light equipment, or driving a motor vehicle. Major Duties: Analyze and define data requirements and specifications Develop standards, policies and procedures Manage the compilation, cataloging, caching, distribution, and retrieval of data Provide a managed flow of relevant information (via web-based portals or other means) based on mission requirements Analyze data sources to provide actionable recommendations Develop strategic insights from large data sets Program custom algorithms Provide actionable recommendations to critical stakeholders based on data analysis and findings Utilize different programming languages to write code, open files, read files, and write output to different files Build complex data structures with high-level programming languages that support the operational and programming functions of the High-Performance Operations Division"], "Education": "There is no education substitute or requirement for the GS-12 level.", "Requirements": "", "Evaluations": "IN DESCRIBING YOUR EXPERIENCE, PLEASE BE CLEAR AND SPECIFIC. WE WILL NOT MAKE ASSUMPTIONS REGARDING YOUR EXPERIENCE. Applicants will be referred in the order in which they were received.", "HowToApply": "All applicants are encouraged to apply online. To apply for this position, you must complete the occupational questionnaire and submit the documentation specified in the Required Documents section. The complete application package must be submitted by 11:59 PM (EST) on 07/26/2024 to receive consideration. To preview the questionnaire click https://apply.usastaffing.gov/ViewQuestionnaire/12464933. 1. To begin, click Apply Online to create a USAJOBS account or log in to your existing account. Follow the prompts to select your USAJOBS resume and/or other supporting documents and complete the occupational questionnaire. 2. Click Submit My Answers to submit your application package. NOTE: It is your responsibility to ensure your responses and appropriate documentation is submitted prior to the closing date. To verify your application is complete, log into your USAJOBS account, https://my.usajobs.gov/Account/Login, select the Application Status link and then select the More Information link for this position. The Details page will display the status of your application, the documentation received and processed, and any correspondence the agency has sent related to this application. Your uploaded documents may take several hours to clear the virus scan process. To return to an incomplete application, log into your USAJOBS account and click Update Application in the vacancy announcement. You must re-select your resume and/or other documents from your USAJOBS account or your application will be incomplete.", "WhatToExpectNext": "After the vacancy announcement closes, applicants are evaluated to ensure qualification and eligibility requirements are met. After the review is complete, a referral certificate(s) is issued and applicants will be notified of their status by email.", "RequiredDocuments": "Documents Accepted: Cover Letter DD-214/ Statement of Service Disability Letter (Schedule A) Disability Letter (VA) License Other (1) PCS Orders Performance Appraisal Professional Certification Proof of Marriage Status Resume Separation Notice (RIF) SF-15 SF-50/ Notification of Personnel Action Transcript Documents Required: Resume Please review the above list(s) to ensure you have included all necessary documents required for your application.Not every applicant will require the same documents, therefore it is the applicants responsibility to ensure that their application package includes all necessary documents to determine qualifications and eligibility for appointment, such as a copy of your SF-50, transcript, ICTAP/CTAP documentation (for displaced Federal employees).You will not be contacted for additional information. Applicants will be deemed ineligible if supporting documentation is not submitted. Veterans' Preference: Since the Direct-Hire Recruitment Authority is being used, traditional Veterans' Preference rules do not apply. Qualified veterans will, however, be given full consideration for this position. Applications are accepted online. Applying online will allow you to review and track the status of your application.", "Benefits": "", "BenefitsUrl": "http://www.vacareers.va.gov/why-choose-va/benefits/index.asp", "BenefitsDisplayDefaultText": true, "OtherInformation": "Receiving Service Credit or Earning Annual (Vacation) Leave: Federal Employees earn annual leave at a rate (4, 6 or 8 hours per pay period) which is based on the number of years they have served as a Federal employee. Selected applicants may qualify for credit toward annual leave accrual, based on prior work experience or military service experience. This credited service can be used in determining the rate at which they earn annual leave. Such credit must be requested and approved prior to the appointment date and is not guaranteed. Special Employment Consideration: VA encourages persons with disabilities to apply, including those eligible for hiring under 5 CFR 213.3102(u), Schedule A, Appointment of persons with disabilities [i.e., intellectual disabilities, severe physical disabilities, or psychiatric disabilities], and/or Disabled veterans with a compensable service-connected disability of 30% or more. Contact the Agency Contact for information on how to apply under this appointment authority via the Selective Placement Coordinator. The Interagency Career Transition Assistance Plan (ICTAP) and Career Transition Assistance Plan (CTAP) provide eligible displaced Federal/VA competitive service employees with selection priority over other candidates for competitive service vacancies. To be qualified you must submit appropriate documentation (a copy of the agency notice, your most recent performance rating, and your most recent SF-50 noting current position, grade level, and duty location) and be found well-qualified for this vacancy. To be well-qualified: applicants must possess experience that exceeds the minimum qualifications of the position including all selective factors, and who are proficient in most of the required competencies of the job. Information about ICTAP and CTAP eligibility is on OPM's Career Transition Resources website at http://www.opm.gov/policy-data-oversight/workforce-restructuring/employee-guide-to-career-transition/. This job opportunity announcement may be used to fill additional vacancies. If you are unable to apply online or need an alternate method to submit documents, please reach out to the Agency Contact listed in this Job Opportunity Announcement.", "KeyRequirements": [], "WithinArea": "False", "CommuteDistance": "0", "ServiceType": "01", "AnnouncementClosingType": "01", "AgencyContactEmail": "VHANationalRecruitmentCenter@va.gov", "AgencyContactPhone": "(844)456-5208", "SecurityClearance": "Other", "DrugTestRequired": "False", "PositionSensitivitiy": "High Risk (HR)", "AdjudicationType": ["Suitability/Fitness"], "TeleworkEligible": false, "RemoteIndicator": true}, "IsRadialSearch": false}}, "RelevanceRank": 0}]